import org.junit.jupiter.api.Test;

public class Task {
    @Test
    void task1() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Rider' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, что ссылка выше кнопки 'Download' имеет текст 'part of dotUltimate' (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         */

    }

    @Test
    void task2() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Store' в навигационном меню сайта (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'JetBrains AI' (На скрине img_3 вы найдёте под пунктом 2 элемент из этого шага).
         - Кликнуть по кнопке 'Watch video' (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что заголовок видео содержит текст "JetBrains AI Assistant" (На скрине img_7 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

    @Test
    void task3() {
      /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Fleet' (На скрине img_5 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, что кнопка 'Download' не задизейблена (На скрине img_6 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

}
