package org.example;

import org.junit.jupiter.api.Test;

public class Task {

    @Test
    void task1() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Перейдите на сайт https://silverscreen.by/
         - Развернуть окно браузера на весь экран
         - Кликнуть по кнопке 'Афиша' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Сейчас в кино' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, что текст 'Афиша кино' и вкладка 'Скоро' видны (На скрине img_2 вы найдёте под пунктами 1 и 2 нужные элементы из этого шага).
         */
    }

    @Test
    void task2() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Перейдите на сайт https://silverscreen.by/
         - Развернуть окно браузера на весь экран
         - Кликнуть по кнопке 'Афиша' в навигационном меню сайта. (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Сейчас в кино' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Нажать на вкладку 'Скоро' (На скрине img_2 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, что текст 'Все месяцы' у самого первого фильтра виден (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

    @Test
    void task3() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Перейдите на сайт https://silverscreen.by/
         - Развернуть окно браузера на весь экран.
         - Кликнуть по кнопке 'Афиша' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага)
         - Кликнуть по пункту меню 'Сейчас в кино' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, что фильтр с текстом текущей датой виден (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

}
