import clothes.Clothe;
import clothes.MenWear;
import clothes.WomenWear;

public class Atelier {

    public void menwear(Clothe[] clothes){
        for (Clothe clothe : clothes){
            if (clothe instanceof MenWear){
                ((MenWear) clothe).towearmen();
            }
        }
    }

    public void womanwear(Clothe[] clothes){
        for (Clothe clothe: clothes){
            if (clothe instanceof WomenWear){
                ((WomenWear) clothe).towearwomen();
            }
        }
    }
}

   // void task2() {
        /*
        Создать перечисление (enum), содержащее размеры одежды (XXS, XS, S, M, L). Перечисление содержит метод getDescription,
        возвращающий строку "Взрослый размер". Переопределить метод getDescription - для константы XXS метод должен возвращать строку “Детский размер”.  Также перечисление должно содержать числовое значение euroSize(32, 34, 36, 38, 40), соответствующее каждому размеру. Создать конструктор, принимающий на вход euroSize.
        Создать интерфейсы "Мужская Одежда" с методом "одетьМужчину" и "Женская Одежда" с методом "одетьЖенщину".
        Создать абстрактный класс Одежда, содержащий переменные - размер одежды, стоимость, цвет.
        Создать классы наследники Одежды - Футболка (реализует интерфейсы "Мужская Одежда" и "Женская Одежда"),
        Штаны (реализует интерфейсы "Мужская Одежда" и "Женская Одежда"), Юбка (реализует интерфейсы "Женская Одежда"),
        Галстук (реализует интерфейсы "Мужская Одежда").
        Создать массив, содержащий все типы одежды. Создать класс Ателье, содержащий методы одетьЖенщину, одетьМужчину,
        на вход которых будет поступать массив, содержащий все типы одежды. Метод одетьЖенщину выводит на консоль всю информацию
         о женской одежде. То же самое для метода одетьМужчину.
        */

