public class Task {
    void task1() {
      /*
        Создать класс Product с приватными параметрами name, productId и гетеры/сеттеры для этих параметров.
        Создать динамический массив из объектов Product.
        Массив должен содержать минимум 4 продукта, название для продуктов придумайте сами.
        Изменить productId второго продукт на 0.
        Замените название последнего проекта на название первого проекта.
        С помощью Stream API отфильтровать продукты по условию productId не ровно 0.
        В этой же цепочке вызовов методов выполнить сортировку имени проектов по убыванию.
        В этой же цепочке вызовов методов удалите все дубликаты и выведите каждое имя проекта в обратном порядке.
         */
    }

    void task2() {
        /*
        Создать динамический массив из объектов Product.
        Массив должен содержать минимум 8 продуктов, название для продуктов придумайте сами.
        Изменить название последних трёх продуктов на название первого продукта.
        С помощью Stream API выполнить группировку по имени проекта и посчитать сумму, минимальное значение, максимальное значение и среднее значение productId для каждой группы.
        Результат вывести в консоль
         */
    }

    void task3() {
        /*
        Создать динамический массив из объектов Product.
        Массив должен содержать минимум 4 продукта, название для продуктов придумайте сами.
        С помощью параллельного стрима выполните перемножение productId всех проектов.
        Выполните приведение reduce к числу с результатом через метод get.
        В результате вывести в консоль
         */
    }

}
