import org.junit.jupiter.api.Test;
public class Task {

    @Test
    void task2() {
        /*
        Напишите тест, который будет переходить на сайт https://mvnrepository.com/.
        Выполнить проверку текущего URL с использованием Assertions из Junit5.
        Проверьте, что текущий url действительно https://mvnrepository.com/

        Создайте отдельный класс MainPage.
        Инкапсулируйте логику переход на сайт по нужному адресу в отдельный метод в классе MainPage.

        Обновите тест с использованием MainPage, у вас должен быть переход на сайт https://mvnrepository.com/ через новый метод из класса MainPage.
         */
    }

    @Test
    void task3() {
        /*
        В классе для тестов создайте отдельный метод, для закрытия драйвера и всех связанных с ним окон.
        Этот метод должен выполняться после запуска каждого теста в тестовом классе.
        Для вызова метода закрытия драйвера и всех связанных с ним окон после каждого теста в текущей классе используйте необходимую аннотацию из Junit5.

        Создайте второй тест в этом же тестовом классе.
        Второй тест должен иметь почти такой же код как и первый тест, но вам надо будет внести специально изменения в проверку так, что бы тест упал.

        В результате у вас будет один тест проходить, а второй будет падать.
        */
    }
}


