package sacovec.olga;
import org.junit.jupiter.api.Test;
public class Task {

    @Test
    void task1() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'IntelliJ IDEA' (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверить, что текст куки баннер в левом нижнем углу виден (На скрине img_1 вы найдёте под пунктом 3 элемент из этого шага).
         */
    }

    @Test
    void task2() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
          - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Team Tools' в навигационном меню сайта (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Datalore' (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по кнопке 'Watch overview' (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что заголовок видео 'Datalore Overview (2024) – The Collaborative Data Science Platform for Teams' виден (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

    @Test
    void task3() {
      /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.jetbrains.com/
         - Кликнуть на выпадающий список 'Developer Tools' в навигационном меню сайта (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Aqua' (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по ссылке 'Documentation' (На скрине img_7 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по панели 'Overview' (На скрине img_8 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункта навигационного меню 'User Interface' (На скрине img_6 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что родная высота картинки 1406 и ширина картинки 3008 (На скрине img_6 вы найдёте под пунктом 2 элемент из этого шага).
         */
    }

}
