public class Task {
    void task1() {
            /*
        Вам надо разработать 3 теста, сценарий для каждого теста я вам уже придумал и запишу ниже.

        Все тесты должны быть разработаны с использованием PageObject pattern и Selenide

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.ticketpro.by/
         - В навигационном меню сайта навести на пункт меню "Театр" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - В выпадающем списке выбрать "Драма" (На скрине img_1 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверьте, что заголовок 'Драматические спектакли' виден (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).

        Второй тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.ticketpro.by/
         - В навигационном меню сайта навести на пункт меню "Театр" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - В выпадающем списке выбрать "Комедия".
         - Проверьте, что заголовок 'Комедийные спектакли' виден.

        Третий тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.ticketpro.by/
         - В навигационном меню сайта навести на пункт меню "Театр" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - В выпадающем списке выбрать "Балет".
         - Проверьте, что заголовок 'Балет и танцевальные спектакли' виден.


         Подумайте, как записать эти 3 теста в одном тестовом методе с использованием датапровайдера.
         Эти тесты должны запускаться параллельно.
         Если вы сделаете 3 разных тестовых метода для каждого жанра, то такое решение не будет засчитано.
         */
    }

    void task2() {
          /*
        Вам надо разработать 1 тест, сценарий для теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern и Selenide

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.ticketpro.by/
         - В шапке сайта кликнуть на ссылку "Промоутеры" (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что лого ticketpro имеет расширение png. (На скрине img_3 вы найдёте под пунктом 2 элемент из этого шага).
         */
    }

    void task3() {
    /*
        Вам надо разработать 1 тест, сценарий для теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern и Selenide

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://www.ticketpro.by/
         - В шапке сайта кликнуть по иконке входа (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать на кнопку "Войти" (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что url не поменялся и имеет значение "https://www.ticketpro.by/auth/login/".
         */
    }

}
